MrKaeser00/micropython/ports/esp32/boards/KNIWWELINO_X/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "KniwwelinoX"
#define MICROPY_HW_MCU_NAME "ESP32-D0WD"

